grid = [['.', '.', '.', '.', '.', '.'],
        ['.', 'O', 'O', '.', '.', '.'],
        ['O', 'O', 'O', 'O', '.', '.'],
        ['O', 'O', 'O', 'O', 'O', '.'],
        ['.', 'O', 'O', 'O', 'O', 'O'],
        ['O', 'O', 'O', 'O', 'O', '.'],
        ['O', 'O', 'O', 'O', '.', '.'],
        ['.', 'O', 'O', '.', '.', '.'],
        ['.', '.', '.', '.', '.', '.']]
# 此题难点在于顺序，应该先读取上下顺序，再读取左右顺序。
# 研究列表可以发现，纵向为range(len(grid))，
# 横向为range(len(grid[i]))，i可以为range(len(grid))中任何数。
# 因此，可以用下面的循环，注意循环顺序。
for x in range(len(grid[0])):
    for y in range(len(grid)):
        # 添加end参数为''，以防止输出每个元素都换行。
        print(grid[y][x], end='')
    # 在每个纵向读取时添加print('')，用来换行。
    print('')